In [167]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [168]:
data = pd.read_csv("swiggy.csv")
data.head()

,id,restaurent,city,rating,rating_count,cost,cuisine,lic_no,link,address,menu
0,567335,AB FOODS POINT,Abohar,--,Too Few Ratings,₹ 200,"Beverages,Pizzas",2.21227E+13,https://www.swiggy.com/restaurants/ab-foods-po...,"AB FOODS POINT, NEAR RISHI NARANG DENTAL CLINI...",Menu/567335.json
1,531342,Janta Sweet House,Abohar,4.4,50+ ratings,₹ 200,"Sweets,Bakery",1.21172E+13,https://www.swiggy.com/restaurants/janta-sweet...,"Janta Sweet House, Bazar No.9, Circullar Road,...",Menu/531342.json
2,158203,theka coffee desi,Abohar,3.8,100+ ratings,₹ 100,Beverages,2.21217E+13,https://www.swiggy.com/restaurants/theka-coffe...,"theka coffee desi, sahtiya sadan road city",Menu/158203.json
3,187912,Singh Hut,Abohar,3.7,20+ ratings,₹ 250,"Fast Food,Indian",2.21197E+13,https://www.swiggy.com/restaurants/singh-hut-n...,"Singh Hut, CIRCULAR ROAD NEAR NEHRU PARK ABOHAR",Menu/187912.json
4,543530,GRILL MASTERS,Abohar,--,Too Few Ratings,₹ 250,"Italian-American,Fast Food",1.21222E+13,https://www.swiggy.com/restaurants/grill-maste...,"GRILL MASTERS, ADA Heights, Abohar - Hanumanga...",Menu/543530.json

In [169]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148541 entries, 0 to 148540
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            148541 non-null  int64
 1   restaurent    148455 non-null  object
 2   city          148541 non-null  object
 3   rating        148455 non-null  object
 4   rating_count  148455 non-null  object
 5   cost          148410 non-null  object
 6   cuisine       148442 non-null  object
 7   lic_no        148312 non-null  object
 8   link          148541 non-null  object
 9   address       148455 non-null  object
 10  menu          148541 non-null  object
dtypes: int64(1), object(10)
memory usage: 12.5+ MB

In [170]:
data.describe()

                  id
count  148541.000000
mean   363466.378912
std    167890.977174
min       211.000000
25%    233320.000000
50%    412628.000000
75%    502223.000000
max    581031.000000

In [171]:
data.shape

(148541, 11)

In [172]:
data = data.rename(columns={'Unnamed:0':'id','name':'Restaurant'})
data.drop_duplicates(subset='id', keep='first', inplace=True)
data.shape

(148541, 11)

In [173]:
Cities = list(data.keys())
len(Cities)

11

In [174]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148541 entries, 0 to 148540
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            148541 non-null  int64
 1   restaurent    148455 non-null  object
 2   city          148541 non-null  object
 3   rating        148455 non-null  object
 4   rating_count  148455 non-null  object
 5   cost          148410 non-null  object
 6   cuisine       148442 non-null  object
 7   lic_no        148312 non-null  object
 8   link          148541 non-null  object
 9   address       148455 non-null  object
 10  menu          148541 non-null  object
dtypes: int64(1), object(10)
memory usage: 13.6+ MB

# Checking the Null values

In [175]:
round(100*(data.isnull().sum())/len(data))

id              0.0
restaurent      0.0
city            0.0
rating          0.0
rating_count    0.0
cost            0.0
cuisine         0.0
lic_no          0.0
link            0.0
address         0.0
menu            0.0
dtype: float64

# Checking the duplicate values

In [176]:
data.duplicated().sum()

0

# Checking the unique values

In [177]:
data.nunique()

id              148541
restaurent      112818
city               821
rating              42
rating_count         8
cost               363
cuisine           2132
lic_no            1362
link            148541
address         148401
menu            148541
dtype: int64

In [178]:
data['rating'].value_counts()

--     87014
4       6532
4.1     6296
4.2     5821
3.8     5736
3.9     5435
4.3     5011
3.7     4253
4.4     3149
3.5     2963
3.6     2925
3.4     1879
3.3     1801
4.5     1778
4.6     1334
3.2     1202
3        859
3.1      791
4.7      648
2.8      473
2.9      472
4.8      338
2.7      325
2.5      221
5        209
2.6      208
4.9      174
2.3      128
2.4      118
2.2       89
2         72
2.1       61
1.9       46
1.8       27
1.5       18
1.6       17
1.7       13
1.4       10
1.2        4
1.3        3
1.1        1
1          1
Name: rating, dtype: int64

In [179]:
data["cost"]=data["cost"].str.split("₹").str[1]

In [180]:
data["cost"]

0          200
1          200
2          100
3          250
4          250
          ...
148536     200
148537     300
148538     300
148539     250
148540     200
Name: cost, Length: 148541, dtype: object

In [181]:
# converting objext string datatype to float
data['cost']=data["cost"].astype(float)

In [182]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148541 entries, 0 to 148540
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            148541 non-null  int64
 1   restaurent    148455 non-null  object
 2   city          148541 non-null  object
 3   rating        148455 non-null  object
 4   rating_count  148455 non-null  object
 5   cost          148410 non-null  float64
 6   cuisine       148442 non-null  object
 7   lic_no        148312 non-null  object
 8   link          148541 non-null  object
 9   address       148455 non-null  object
 10  menu          148541 non-null  object
dtypes: float64(1), int64(1), object(9)
memory usage: 13.6+ MB

In [183]:
# replacing "__" with nan values
data['rating'].replace("--", np.nan, inplace=True)

In [184]:
data['rating']

0         NaN
1         4.4
2         3.8
3         3.7
4         NaN
         ...
148536    NaN
148537    NaN
148538    NaN
148539    NaN
148540    NaN
Name: rating, Length: 148541, dtype: object

In [185]:
data['rating'].fillna(data['rating'].median(), inplace = True)

In [186]:
data['rating']

0         4.0
1         4.4
2         3.8
3         3.7
4         4.0
         ...
148536    4.0
148537    4.0
148538    4.0
148539    4.0
148540    4.0
Name: rating, Length: 148541, dtype: object

In [187]:
data['rating_count']

0         Too Few Ratings
1             50+ ratings
2            100+ ratings
3             20+ ratings
4         Too Few Ratings
               ...
148536    Too Few Ratings
148537    Too Few Ratings
148538    Too Few Ratings
148539    Too Few Ratings
148540    Too Few Ratings
Name: rating_count, Length: 148541, dtype: object

# Feature Engineering: Mapping types of rating_counts int 0 numerical values

In [188]:
data['rating_count']=data['rating_count'].map({"10k+sratings": 1, '5k+ ratings': 2, '1k+ ratings': 3, '500+ ratings': 4, '50+ ratings': 5,'100+ratings': 6, '20+ ratings': 7, 'Too Few Ratings': 8})

In [189]:
data['rating_count']

0         8.0
1         5.0
2         NaN
3         7.0
4         8.0
         ...
148536    8.0
148537    8.0
148538    8.0
148539    8.0
148540    8.0
Name: rating_count, Length: 148541, dtype: float64

In [190]:
data['rating_count'].value_counts()

8.0    87014
7.0    21636
5.0    12009
4.0     4396
Name: rating_count, dtype: int64

In [191]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 148541 entries, 0 to 148540
Data columns (total 11 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   id            148541 non-null  int64
 1   restaurent    148455 non-null  object
 2   city          148541 non-null  object
 3   rating        148541 non-null  object
 4   rating_count  125055 non-null  float64
 5   cost          148410 non-null  float64
 6   cuisine       148442 non-null  object
 7   lic_no        148312 non-null  object
 8   link          148541 non-null  object
 9   address       148455 non-null  object
 10  menu          148541 non-null  object
dtypes: float64(2), int64(1), object(8)
memory usage: 13.6+ MB

In [192]:
data['city'].value_counts().sort_values()

Rangpo                       1
Noida Expressway,Delhi       1
Kohima                       1
Manali                       1
BBK_MayurVihar,Delhi         1
                          ...
Rohini,Delhi              1136
BTM,Bangalore             1161
Indirapuram,Delhi         1279
Noida-1                   1428
Bikaner                   1666
Name: city, Length: 821, dtype: int64

### Identify the number of restaurants listed on Swiggy in India

Determine the number of cities that have restaurants listed on Swiggy

Identify the city with the maximum number of restaurants listed on Swiggy

Determine the top 10 cities as per the number of restaurants listed on Swiggy

Determine the most popular cuisines served throughout the dataset

Identify the city with the least expensive restaurant in terms of cost

Determine the top 5 most popular restaurant chains in India

Identify the restaurant in Bangalore that has the most number of people visited based on the number of reviews

In [193]:
# grouping the dataset by city and count the number of unique restaurant IDs in each city
city_counts=data.groupby('city')['id'].nunique()
#get the city with the maximum count
max_city=city_counts.idxmax()

# Print the result
print('City with the maximum number of restaurants listed on Swiggy:', max_city)

City with the maximum number of restaurants listed on Swiggy: Bikaner

In [194]:
max_city = city_counts.nlargest(10)
max_city

city
Bikaner                      1666
Noida-1                      1428
Indirapuram,Delhi            1279
BTM,Bangalore                1161
Rohini,Delhi                 1136
Kothrud,Pune                 1089
Indiranagar,Bangalore        1080
Electronic City,Bangalore    1039
Greater Kailash 2,Delhi      1038
Vashi,Mumbai                 1022
Name: id, dtype: int64

In [195]:
popular_cuisine =data['cuisine'].value_counts()
popular_cuisine.head(10)

North Indian,Chinese    6471
Indian                  6414
Chinese                 5051
North Indian            4775
Indian,Chinese          4374
South Indian            3303
Bakery                  3132
Chinese,Indian          2308
Chinese,North Indian    2288
Bakery,Desserts         2233
Name: cuisine, dtype: int64

In [196]:
city_cost = data.groupby('city')['cost'].mean().sort_values()
least_expensive_city = city_cost.head(10)
print(f"The city with the least expensive restaurants is{least_expensive_city}.")

The city with the least expensive restaurants iscity
Hampi               100.000000
Hindaun             121.052632
Hansi               148.421053
Jalaun              150.000000
Amreli              152.962963
Bathinda            167.115607
Alambagh,Lucknow    167.272727
Nandurbar           169.230769
Shrirampur          169.444444
Sehore              169.850000
Name: cost, dtype: float64.

In [197]:
top_chains = data.groupby('restaurent')['id'].count().sort_values(ascending=False).head(5).index.tolist()
print("The top 5 most popular restaurant chains in India are:")
for chain in top_chains:
    print(chain)

The top 5 most popular restaurant chains in India are:
Domino's Pizza
Pizza Hut
KFC
Kwality Walls Frozen Dessert and Ice Cream Shop
Baskin Robbins

In [198]:
bangalore_data=data[data['city']=='Bangalore']
most_popular_restaurant = bangalore_data.sort_values('rating_count', ascending=False)['restaurent'].index.tolist
print(f"The restaurant in Bangalore with the most number of people visited is{most_popular_restaurant}.")

The restaurant in Bangalore with the most number of people visited is<bound method IndexOpsMixin.tolist of Int64Index([], dtype='int64')>.